import logging

from pydantic import BaseModel
from .enums import AppColor


class AppSettings(BaseModel):
    title: str = "🤖 CHAT GPT APP"
    version: str = "1.0.0"
    description: str = """
    📱Веб приложение ЧАТ ГПТ🤖
    Данный проект основан как бесплатное приложение для интеграции ваших приложений
    Основые эдпоинты:
       - /v1/ - корень нашего проекта возратным значением будет ваш IP адрес
         └ Данный эдпоинт ничего не принимает но возращает он ваш текущий IP адрес
         └ Или ваш локальный Ip адрес если вы запустили приложения для теста на localhost
         

       - /v1/chat/create - В этом эдпоинте нужно ввести модель исскуственного интелекта 
         └ данные модели не нужно будет вводить вручную т.к там используется класс для перечеслений
         └ вы просто выбираете модель, затем вы вводите промнт и готово✅
         └ посокльку эта только первая версия приложния она будет обновляться
         
    Приятного использования🥰
    """
    
    
    
log = logging.getLogger(__name__)


class LifespanHelper:
    def __init__(self) -> None:
        pass 
    
    async def start_app(self):
        """
        Запускает инициализацию приложения и настраивает логирование.

        Если логгер еще не настроен, метод создает кастомный StreamHandler 
        с раскраской через AppColor. Устанавливает формат вывода: 
        время, уровень важности, имя логгера и само сообщение.

        Note:
            Использует Цветовую кастомную палитру  для терминала, чтобы логи было легче читать 
            во время разработки.
        """
        
        
        if not log.handlers:
            handler = logging.StreamHandler()
            formatter = logging.Formatter(
                f"{AppColor.BLUE.value}%(asctime)s | "
                f"{AppColor.RED.value}   %(levelname)-8s{AppColor.RESET.value}| "
                f" {AppColor.MAGENTA.value}%(name)s {AppColor.RESET.value}| {AppColor.YELLOW.value}%(message)s",
                datefmt="%Y-%m-%d %H:%M:%S"
            )
            handler.setFormatter(formatter)
            log.addHandler(handler)
            log.setLevel(logging.INFO)
        log.info("START APP")
        
    async def close_app(self):
        """
        Завершает работу приложения.

        Выводит окончательное сообщение в терминал.
        """
        log.info("CLOSE APP")
        


app_settings = AppSettings()
lifespan_helper = LifespanHelper()